chore: update readme and documentation
